In [2]:
# import prompt
from constants import DATABASE_PATH_PATTERN, DEV_JSON_PATH
import json

Special tokens have been added in the vocabulary, make sure the associated word embeddings are fine-tuned or trained.

In [4]:
with open(DEV_JSON_PATH, "r") as input_file:
    dataset = json.load(input_file)
with open("./0319_step_2.json","r") as input_file:
    pred_dataset = json.load(input_file)
print(len(pred_dataset))
assert(len(dataset) == len(pred_dataset))

1034

In [4]:
pred_output = []
for pred in pred_dataset[:]:
    pred_output.append(pred[pred.find("SELECT "):    ])
    # lines = pred.split("\n")[1:]
    # table ={}
    # for line in lines:
    #     pos = line.find(":")
    #     table_name = line[:pos]
    #     columns = line[pos + 3 : -1].strip().split(",")
    #     if columns[0] == "":
    #         columns=list()
    #     table[table_name] = set(columns)
    # pred_output.append(table)
with open("./0314_step_2.json", "w") as output_file:
    json.dump(pred_output, output_file,)

In [7]:
from sql_metadata import Parser
import sqlparse


def equal(pred: dict[str, set], gold: dict[str, set]) -> bool:
    return pred == gold


def table_contain(pred: dict[str, set], gold: dict[str, set]) -> bool:
    return set(gold.keys()).issubset(set(pred.keys()))


def contain(pred: dict[str, set], gold: dict[str, set]) -> bool:
    for table, columns in gold.items():
        if table in pred:
            if columns.issubset(pred[table]):
                continue
            else:
                return False
        else:
            return False
    return True


equal_cnt = 0
contain_cnt = 0
table_contain_cnt = 0

for i in range(len(dataset)):
    db_path = DATABASE_PATH_PATTERN.format(db_id=dataset[i]["db_id"])

    parsed_query = sqlparse.parse(dataset[i]["query"])[0]
    formatted_query = sqlparse.format(
        str(parsed_query),
        reindent=False,
        keyword_case="upper",
        identifier_case="lower",
        strip_whitespace=True,
    )
    parse = Parser(formatted_query)
    correct_tables = parse.tables
    correct_columns = parse.columns
    print(formatted_query)
    print(correct_columns)
    print(correct_tables)
    print()
    continue
    pred = prompt.get_relevant_tables(db_path, pred_output[i],False, False)
    gold_output = prompt.get_relevant_tables(db_path, dataset[i]["query"], False, False)
    # print(pred)
    # print(gold_output)

    is_equal = equal(pred, gold_output)
    is_table_contain = table_contain(pred, gold_output)
    is_contain = contain(pred, gold_output)
    if is_equal:
        equal_cnt += 1
    if is_table_contain:
        table_contain_cnt += 1
    else:
        print("question: ", dataset[i]["question"])
        print("sql: ", dataset[i]["query"])
        print("pred: ", pred)
        print("gold: ", gold_output)
        print()

    if is_contain:
        contain_cnt += 1


print(equal_cnt)
print(contain_cnt)
print(table_contain_cnt)

SELECT count(*) FROM singer
[]
['singer']

SELECT count(*) FROM singer
[]
['singer']

SELECT name, country, age FROM singer ORDER BY age DESC
['name', 'country', 'age']
['singer']

SELECT name, country, age FROM singer ORDER BY age DESC
['name', 'country', 'age']
['singer']

SELECT avg(age), min(age), max(age) FROM singer WHERE country = 'France'
['age', 'country']
['singer']

SELECT avg(age), min(age), max(age) FROM singer WHERE country = 'France'
['age', 'country']
['singer']

SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1
['song_name', 'song_release_year', 'age']
['singer']

SELECT song_name, song_release_year FROM singer ORDER BY age LIMIT 1
['song_name', 'song_release_year', 'age']
['singer']

SELECT DISTINCT country FROM singer WHERE age > 20
['country', 'age']
['singer']

SELECT DISTINCT country FROM singer WHERE age > 20
['country', 'age']
['singer']

SELECT country, count(*) FROM singer GROUP BY country
['country']
['singer']

SELECT country, count(*) FROM singer GROUP BY country
['country']
['singer']

SELECT song_name FROM singer WHERE age > (SELECT avg(age) FROM singer)
['song_name', 'age']
['singer']

SELECT song_name FROM singer WHERE age > (SELECT avg(age) FROM singer)
['song_name', 'age']
['singer']

SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
['LOCATION', 'name', 'capacity']
['stadium']

SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
['LOCATION', 'name', 'capacity']
['stadium']

SELECT max(capacity), average FROM stadium
['capacity', 'average']
['stadium']

SELECT avg(capacity), max(capacity) FROM stadium
['capacity']
['stadium']

SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1
['name', 'capacity', 'average']
['stadium']

SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1
['name', 'capacity', 'average']
['stadium']

SELECT count(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015
[]
['concert']

SELECT count(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015
[]
['concert']

SELECT t2.name, count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id GROUP BY t1.stadium_id
['stadium.name', 'concert.stadium_id', 'stadium.stadium_id']
['concert', 'stadium']

SELECT t2.name, count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id GROUP BY t1.stadium_id
['stadium.name', 'concert.stadium_id', 'stadium.stadium_id']
['concert', 'stadium']

SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year >= 2014 GROUP BY t2.stadium_id ORDER BY count(*) DESC LIMIT 1
['stadium.name', 'stadium.capacity', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['concert', 'stadium']

SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year > 2013 GROUP BY t2.stadium_id ORDER BY count(*) DESC LIMIT 1
['stadium.name', 'stadium.capacity', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['concert', 'stadium']

SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
[]
['concert']

SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
[]
['concert']

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
['name', 'stadium_id']
['stadium', 'concert']

SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
['name', 'stadium_id']
['stadium', 'concert']

SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30
['country', 'age']
['singer']

SELECT name FROM stadium EXCEPT SELECT t2.name FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014
['name', 'stadium.name', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['stadium', 'concert']

SELECT name FROM stadium EXCEPT SELECT t2.name FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014
['name', 'stadium.name', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['stadium', 'concert']

SELECT t2.concert_name, t2.theme, count(*) FROM singer_in_concert AS t1 JOIN concert AS t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_id
['concert.concert_name', 'concert.theme', 'singer_in_concert.concert_id', 'concert.concert_id']
['singer_in_concert', 'concert']

SELECT t2.concert_name, t2.theme, count(*) FROM singer_in_concert AS t1 JOIN concert AS t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_id
['concert.concert_name', 'concert.theme', 'singer_in_concert.concert_id', 'concert.concert_id']
['singer_in_concert', 'concert']

SELECT t2.name, count(*) FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id GROUP BY t2.singer_id
['singer.name', 'singer_in_concert.singer_id', 'singer.singer_id']
['singer_in_concert', 'singer']

SELECT t2.name, count(*) FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id GROUP BY t2.singer_id
['singer.name', 'singer_in_concert.singer_id', 'singer.singer_id']
['singer_in_concert', 'singer']

SELECT t2.name FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id JOIN concert AS t3 ON t1.concert_id = t3.concert_id WHERE t3.year = 2014
['singer.name', 'singer_in_concert.singer_id', 'singer.singer_id', 'singer_in_concert.concert_id', 'concert.concert_id', 'concert.year']
['singer_in_concert', 'singer', 'concert']

SELECT t2.name FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id JOIN concert AS t3 ON t1.concert_id = t3.concert_id WHERE t3.year = 2014
['singer.name', 'singer_in_concert.singer_id', 'singer.singer_id', 'singer_in_concert.concert_id', 'concert.concert_id', 'concert.year']
['singer_in_concert', 'singer', 'concert']

SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'
['name', 'country', 'song_name']
['singer']

SELECT name, country FROM singer WHERE song_name LIKE '%Hey%'
['name', 'country', 'song_name']
['singer']

SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014 INTERSECT SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2015
['stadium.name', 'stadium.location', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['concert', 'stadium']

SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2014 INTERSECT SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year = 2015
['stadium.name', 'stadium.location', 'concert.stadium_id', 'stadium.stadium_id', 'concert.year']
['concert', 'stadium']

SELECT count(*) FROM concert WHERE stadium_id = (SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1)
['stadium_id', 'capacity']
['concert', 'stadium']

SELECT count(*) FROM concert WHERE stadium_id = (SELECT stadium_id FROM stadium ORDER BY capacity DESC LIMIT 1)
['stadium_id', 'capacity']
['concert', 'stadium']

SELECT count(*) FROM pets WHERE weight > 10
['weight']
['pets']

SELECT count(*) FROM pets WHERE weight > 10
['weight']
['pets']

SELECT weight FROM pets ORDER BY pet_age LIMIT 1
['weight', 'pet_age']
['pets']

SELECT weight FROM pets ORDER BY pet_age LIMIT 1
['weight', 'pet_age']
['pets']

SELECT max(weight), pettype FROM pets GROUP BY pettype
['weight', 'pettype']
['pets']

SELECT max(weight), pettype FROM pets GROUP BY pettype
['weight', 'pettype']
['pets']

SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.age > 20
['student.stuid', 'has_pet.stuid', 'student.age']
['student', 'has_pet']

SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.age > 20
['student.stuid', 'has_pet.stuid', 'student.age']
['student', 'has_pet']

SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t1.sex = 'F' AND t3.pettype = 'dog'
['student.stuid', 'has_pet.stuid', 'has_pet.petid', 'pets.petid', 'student.sex', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t1.sex = 'F' AND t3.pettype = 'dog'
['student.stuid', 'has_pet.stuid', 'has_pet.petid', 'pets.petid', 'student.sex', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT count(DISTINCT pettype) FROM pets
['pettype']
['pets']

SELECT count(DISTINCT pettype) FROM pets
['pettype']
['pets']

SELECT DISTINCT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat' OR t3.pettype = 'dog'
['student.fname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT DISTINCT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat' OR t3.pettype = 'dog'
['student.fname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat' INTERSECT SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'dog'
['student.fname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat' INTERSECT SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'dog'
['student.fname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT major, age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat')
['major', 'age', 'stuid', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT major, age FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat')
['major', 'age', 'stuid', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT stuid FROM student EXCEPT SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat'
['stuid', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT stuid FROM student EXCEPT SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat'
['stuid', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'dog' AND t1.stuid NOT IN (SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat')
['student.fname', 'student.age', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'dog' AND t1.stuid NOT IN (SELECT t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat')
['student.fname', 'student.age', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1
['pettype', 'weight', 'pet_age']
['pets']

SELECT pettype, weight FROM pets ORDER BY pet_age LIMIT 1
['pettype', 'weight', 'pet_age']
['pets']

SELECT petid, weight FROM pets WHERE pet_age > 1
['petid', 'weight', 'pet_age']
['pets']

SELECT petid, weight FROM pets WHERE pet_age > 1
['petid', 'weight', 'pet_age']
['pets']

SELECT avg(pet_age), max(pet_age), pettype FROM pets GROUP BY pettype
['pet_age', 'pettype']
['pets']

SELECT avg(pet_age), max(pet_age), pettype FROM pets GROUP BY pettype
['pet_age', 'pettype']
['pets']

SELECT avg(weight), pettype FROM pets GROUP BY pettype
['weight', 'pettype']
['pets']

SELECT avg(weight), pettype FROM pets GROUP BY pettype
['weight', 'pettype']
['pets']

SELECT DISTINCT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid
['student.fname', 'student.age', 'student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT DISTINCT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid
['student.fname', 'student.age', 'student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT t2.petid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.lname = 'Smith'
['has_pet.petid', 'student.stuid', 'has_pet.stuid', 'student.lname']
['student', 'has_pet']

SELECT t2.petid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.lname = 'Smith'
['has_pet.petid', 'student.stuid', 'has_pet.stuid', 'student.lname']
['student', 'has_pet']

SELECT count(*), t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid
['student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT count(*), t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid
['student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT t1.fname, t1.sex FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING count(*) > 1
['student.fname', 'student.sex', 'student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT t1.fname, t1.sex FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING count(*) > 1
['student.fname', 'student.sex', 'student.stuid', 'has_pet.stuid']
['student', 'has_pet']

SELECT t1.lname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pet_age = 3 AND t3.pettype = 'cat'
['student.lname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pet_age', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT t1.lname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pet_age = 3 AND t3.pettype = 'cat'
['student.lname', 'student.stuid', 'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pet_age', 'pets.pettype']
['student', 'has_pet', 'pets']

SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet)
['age', 'stuid']
['student', 'has_pet']

SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet)
['age', 'stuid']
['student', 'has_pet']

SELECT count(*) FROM continents;
[]
['continents']

SELECT count(*) FROM continents;
[]
['continents']

SELECT t1.contid, t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent GROUP BY t1.contid;
['continents.contid', 'continents.continent', 'countries.continent']
['continents', 'countries']

SELECT t1.contid, t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent GROUP BY t1.contid;
['continents.contid', 'continents.continent', 'countries.continent']
['continents', 'countries']

SELECT count(*) FROM countries;
[]
['countries']

SELECT count(*) FROM countries;
[]
['countries']

SELECT t1.fullname, t1.id, count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id;
['car_makers.fullname', 'car_makers.id', 'model_list.maker']
['car_makers', 'model_list']

SELECT t1.fullname, t1.id, count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id;
['car_makers.fullname', 'car_makers.id', 'model_list.maker']
['car_makers', 'model_list']

SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.horsepower ASC LIMIT 1;
['car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.horsepower']
['car_names', 'cars_data']

SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.horsepower ASC LIMIT 1;
['car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.horsepower']
['car_names', 'cars_data']

SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.weight < (SELECT avg(weight) FROM cars_data)
['car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.weight', 'weight']
['car_names', 'cars_data']

SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.weight < (SELECT avg(weight) FROM cars_data)
['car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.weight', 'weight']
['car_names', 'cars_data']

SELECT DISTINCT t1.maker FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker JOIN car_names AS t3 ON t2.model = t3.model JOIN cars_data AS t4 ON t3.makeid = t4.id WHERE t4.year = '1970';
['car_makers.maker', 'car_makers.id', 'model_list.maker', 'model_list.model', 'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.year']
['car_makers', 'model_list', 'car_names', 'cars_data']

SELECT DISTINCT t1.maker FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker JOIN car_names AS t3 ON t2.model = t3.model JOIN cars_data AS t4 ON t3.makeid = t4.id WHERE t4.year = '1970';
['car_makers.maker', 'car_makers.id', 'model_list.maker', 'model_list.model', 'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.year']
['car_makers', 'model_list', 'car_names', 'cars_data']

SELECT t2.make, t1.year FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t1.year = (SELECT min(YEAR) FROM cars_data);
['car_names.make', 'cars_data.year', 'cars_data.id', 'car_names.makeid']
['cars_data', 'car_names']

SELECT t2.make, t1.year FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t1.year = (SELECT min(YEAR) FROM cars_data);
['car_names.make', 'cars_data.year', 'cars_data.id', 'car_names.makeid']
['cars_data', 'car_names']

SELECT DISTINCT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t2.makeid = t3.id WHERE t3.year > 1980;
['model_list.model', 'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.year']
['model_list', 'car_names', 'cars_data']

SELECT DISTINCT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t2.makeid = t3.id WHERE t3.year > 1980;
['model_list.model', 'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.year']
['model_list', 'car_names', 'cars_data']

SELECT t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent JOIN car_makers AS t3 ON t2.countryid = t3.country GROUP BY t1.continent;
['continents.continent', 'continents.contid', 'countries.continent', 'countries.countryid', 'car_makers.country']
['continents', 'countries', 'car_makers']

SELECT t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent JOIN car_makers AS t3 ON t2.countryid = t3.country GROUP BY t1.continent;
['continents.continent', 'continents.contid', 'countries.continent', 'countries.countryid', 'car_makers.country']
['continents', 'countries', 'car_makers']


In [6]:
with open("./cot_dataset/train/step_1.json","r") as input_file:
    step_1_dataset = json.load(input_file)

for i in range(len(step_1_dataset)):
    size = len(step_1_dataset[i]["instruction"])
    step_1_dataset[i]["instruction"] = step_1_dataset[i]["instruction"][:size-17]
    step_1_dataset[i]["output"] = "[Relevant Tables]\n"+step_1_dataset[i]["output"]
    print(step_1_dataset[i])
    break
with open("./cot_dataset/train/step_1.json","w") as output_file:
    json.dump(step_1_dataset,output_file)

{'instruction': "Given [Database Schema] and [Foreign Keys], your task is to identify the [Relevant Tables] to answer the [Question].\n\n[Database Schema] Every table consists of several columns. Each line describes the name, type of the column and optional value examples. In some cases, column name can be ambiguous, and extra comment is provided to assist in understanding.\n- Table: department. Primary Key: (department_id)\ndepartment_id, INT\nname, TEXT, Value Examples: ['Defense', 'Veterans Affairs', 'Homeland Security']\ncreation, TEXT, Value Examples: ['1965', '1966', '1953']\nranking, INT\nbudget_in_billions, REAL\nnum_employees, REAL\n- Table: head. Primary Key: (head_id)\nhead_id, INT\nname, TEXT, Value Examples: ['Dudley Hart', 'Nick Faldo', 'Tiger Woods']\nborn_state, TEXT, Value Examples: ['Delaware', 'Florida', 'California']\nage, REAL\n- Table: management. Primary Key: (department_id)\ndepartment_id, INT\nhead_id, INT\ntemporary_acting, TEXT, Value Examples: ['No', 'Yes']\n[Foreign keys]\nmanagement(head_id) references head(head_id)\nmanagement(department_id) references department(department_id)\n[Question]\nHow many heads of the departments are older than 56 ?\n", 'output': '[Relevant Tables]\nhead', 'system': 'You are an experienced and professional database administrator.\n'}

In [1]:
from sql_metadata import Parser
import json
with open("./041601_galore_dev.json", "r") as input_file:
    pred_dataset = json.load(input_file)

fo = open("041601_galore_dev.txt", "w")
for case in pred_dataset:
    position = case.find("SELECT ")
    sql = case[position:].strip()
    # sql = " ".join(sql.split())
    if sql == "":
        sql = "SELECT 1;"
    fo.write(sql + "\n")
fo.close()

In [4]:
import sqlite3
import prompt
import util
from sql_metadata import Parser

with open("./0321_step_2.json", "r") as input_file:
    pred_dataset = json.load(input_file)
with open(DEV_JSON_PATH, "r") as input_file:
    dev_set = json.load(input_file)
with open("spider_dev_comment.json", "r") as input_file:
    comment_map =json.load(input_file)
step_3_set=[]
for i in range(len(pred_dataset)):
    formatted_sql = prompt.format_query(pred_dataset[i])
    parser = Parser(formatted_sql)
    relevant_tables = parser.tables
    relevant_columns = parser.columns
    relevant_tables = [s.lower() for s in relevant_tables]
    relevant_columns = set([s.lower() for s in relevant_columns])
    print(relevant_columns)
    if (len(relevant_tables) == 1) and (formatted_sql.find("YEAR") != -1):
        relevant_columns.add(f"{relevant_tables[0]}.year")
    db_id =dev_set[i]["db_id"]
    db_path = DATABASE_PATH_PATTERN.format(db_id=db_id)
    conn = sqlite3.connect(db_path)
    cursor = conn.cursor()

    table_map = {}
    for table_name in relevant_tables:
        column_info = []
        cursor.execute(f"PRAGMA table_info(`{table_name}`);")
        columns = cursor.fetchall()
        primary_keys = []
        for column in columns:
            column_name = column[1].lower()

            if (column_name in relevant_columns) or (
                f"{table_name}.{column_name}" in relevant_columns
            ):
                if column[5] == 1:
                    primary_keys.append(column_name)
                # name,type
                column_info.append((column_name, column[2].upper()))

        table_map[table_name] = (primary_keys, column_info)
    schema_str = prompt.build_schema_str(db_path, table_map,dev_set[i]["question"],comment_map[db_id])
    
    foreign_key = prompt.build_foreign_key_str(db_path, relevant_tables)
    
    instruction = prompt.STEP_2_INSTRUCTION_PATTERN.format(
        schema=schema_str, foreign_key=foreign_key, question=dev_set[i]["question"]
    )
    cursor.close()
    conn.close()
    step_3_set.append(instruction)
with open("0321_step_3.json", "w") as output_file:
    json.dump(step_3_set,output_file)

set()
set()
{'age', 'name', 'country'}
{'age', 'name', 'country'}
{'age', 'country'}
{'age', 'country'}
{'age', 'name', 'song_release_year'}
{'age', 'song_name', 'song_release_year'}
{'age', 'country'}
{'age', 'country'}
{'country'}
{'country'}
{'age', 'song_name'}
{'age', 'song_name'}
{'location', 'name', 'capacity'}
{'location', 'name', 'capacity'}
{'capacity'}
{'capacity'}
{'name', 'average', 'capacity'}
{'name', 'average', 'capacity'}
set()
set()
{'concert.stadium_id', 'stadium.stadium_id', 'stadium.name'}
{'concert.stadium_id', 'stadium.stadium_id', 'stadium.name'}
{'stadium.stadium_id', 'stadium.name', 'concert.stadium_id', 'concert.year', 'stadium.capacity'}
{'stadium.stadium_id', 'stadium.name', 'concert.stadium_id', 'concert.year', 'stadium.capacity'}
set()
set()
{'name', 'stadium_id'}
{'name', 'stadium_id'}
{'age', 'country'}
{'name', 'stadium_id'}
{'name', 'stadium_id'}
{'concert.concert_id', 'singer_in_concert.concert_id', 'concert.theme', 'concert.concert_name'}
{'concert.concert_id', 'singer_in_concert.concert_id', 'concert.theme', 'concert.concert_name'}
{'singer_in_concert.singer_id', 'singer.name', 'singer.singer_id'}
{'singer_in_concert.singer_id', 'singer.name', 'singer.singer_id'}
{'singer_in_concert.concert_id', 'singer_in_concert.singer_id', 'concert.concert_id', 'singer.name', 'singer.singer_id', 'concert.year'}
{'singer_in_concert.concert_id', 'singer_in_concert.singer_id', 'concert.concert_id', 'singer.name', 'singer.singer_id', 'concert.year'}
{'song_name', 'name', 'country'}
{'song_name', 'name', 'country'}
{'concert.stadium_id', 'stadium.location', 'stadium.stadium_id', 'stadium.name'}
{'concert.stadium_id', 'stadium.location', 'stadium.stadium_id', 'stadium.name'}
{'capacity', 'stadium_id'}
{'capacity', 'stadium_id'}
{'weight'}
{'weight'}
{'weight', 'pettype', 'pet_age'}
{'weight', 'pettype', 'pet_age'}
{'weight', 'pettype'}
{'weight', 'pettype'}
{'has_pet.stuid', 'student.age', 'student.stuid'}
{'has_pet.stuid', 'student.age', 'student.stuid'}
{'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.sex'}
{'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.sex'}
{'pettype'}
{'pettype'}
{'dog', 'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.fname', 'cat'}
{'dog', 'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.fname', 'cat'}
{'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.fname'}
{'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.fname'}
{'major', 'pets.petid', 'has_pet.petid', 'age', 'stuid', 'pettype'}
{'major', 'pets.petid', 'has_pet.petid', 'age', 'stuid', 'pettype'}
{'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype', 'stuid'}
{'has_pet.stuid', 'pets.petid', 'has_pet.petid', 'pets.pettype', 'stuid'}
{'student.age', 'has_pet.stuid', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'student.fname'}
{'pettype', 'stuid', 'petid', 'fname'}
{'weight', 'pettype', 'pet_age'}
{'weight', 'pettype', 'pet_age'}
{'weight', 'pet_age', 'petid'}
{'weight', 'pet_age', 'petid'}
{'pet_age', 'pettype'}
{'pet_age', 'pettype'}
{'weight', 'pettype'}
{'weight', 'pettype'}
{'has_pet.stuid', 'student.age', 'student.fname', 'student.stuid'}
{'age', 'stuid', 'fname'}
{'has_pet.stuid', 'student.stuid', 'lname', 'petid'}
{'smith', 'has_pet.stuid', 'student.stuid', 'lname', 'petid'}
{'has_pet.stuid', 'student.stuid', 'stuid'}
{'has_pet.stuid', 'student.stuid', 'stuid'}
{'has_pet.stuid', 'student.fname', 'student.sex', 'student.stuid'}
{'has_pet.stuid', 'student.fname', 'student.sex', 'student.stuid'}
{'has_pet.stuid', 'student.lname', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'pets.pet_age', 'cat'}
{'has_pet.stuid', 'student.lname', 'pets.petid', 'student.stuid', 'has_pet.petid', 'pets.pettype', 'pets.pet_age', 'cat'}
{'age', 'stuid'}
{'age', 'stuid'}
set()
set()
{'continents.contid', 'countries.continent', 'continents.continent'}
{'continents.contid', 'countries.continent'}
set()
set()
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'car_names.model', 'car_names.makeid', 'horsepower', 'cars_data.id'}
{'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.horsepower'}
{'weight', 'cars_data.weight', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'weight', 'cars_data.weight', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'car_makers.id', 'car_makers.fullname', 'cars_data.year', 'model_list.model', 'model_list.maker', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'car_makers.id', 'car_makers.fullname', 'cars_data.year', 'model_list.model', 'model_list.maker', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'car_names.make', 'car_names.makeid', 'cars_data.id', 'cars_data.year'}
{'car_names.make', 'car_names.makeid', 'cars_data.id', 'cars_data.year'}
{'cars_data.year', 'model_list.model', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'cars_data.year', 'model_list.model', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'countries.countryid', 'continents.continent', 'countries.continent', 'continents.contid', 'car_makers.country'}
{'countries.countryid', 'continents.continent', 'countries.continent', 'continents.contid', 'car_makers.country'}
{'countries.countryname', 'countries.countryid', 'car_makers.country'}
{'countries.countryname', 'countries.countryid', 'car_makers.country'}
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'accelerate', 'cars_data.id', 'amc hornet sportabout (sw)', 'car_names.model', 'car_names.makeid'}
{'model', 'make', 'amc', 'accelerate', 'cars_data.id', 'amc hornet sportabout (sw)', 'car_names.makeid'}
{'france', 'countries.countryid', 'maker', 'countries.countryname', 'car_makers.country'}
{'countries.countryname', 'countries.countryid', 'car_makers.country'}
{'car_makers.id', 'countries.countryid', 'model_list.model', 'model_list.maker', 'countries.countryname', 'car_makers.country'}
{'car_makers.id', 'countries.countryid', 'model_list.maker', 'countries.countryname', 'usa', 'car_makers.country'}
{'mpg', 'cylinders'}
{'mpg', 'cylinders'}
{'weight', 'cylinders'}
{'weight', 'cylinders'}
{'model', 'maker'}
{'model', 'maker'}
{'countryid', 'country', 'countryname'}
{'countryid', 'country', 'countryname'}
{'horsepower'}
{'horsepower'}
{'weight'}
{'weight'}
{'countries.countryid', 'continents.continent', 'countries.continent', 'continents.contid', 'countries.countryname', 'car_makers.country'}
{'countries.countryid', 'continents.continent', 'countries.continent', 'continents.contid', 'countries.countryname', 'car_makers.country'}
{'cars_data.cylinders', 'car_names.make', 'horsepower', 'cars_data.id', 'car_names.makeid'}
{'cars_data.cylinders', 'car_names.make', 'cars_data.horsepower', 'cars_data.id', 'car_names.makeid'}
{'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.mpg'}
{'car_names.model', 'car_names.makeid', 'cars_data.id', 'cars_data.mpg'}
{'horsepower'}
{'horsepower'}
{'car_names.makeid', 'cars_data.id', 'car_names.model', 'edispl', 'volvo'}
{'car_names.make', 'car_names.makeid', 'cars_data.id', 'edispl', 'volvo'}
{'accelerate', 'cylinders'}
{'accelerate', 'cylinders'}
{'model'}
{'model'}
{'cylinders'}
{'cylinders'}
set()
set()
{'car_makers.id', 'american motor company', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'american motor company', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'model_list.maker', 'car_makers.fullname'}
{'car_makers.id', 'car_makers.fullname', 'cars_data.weight', 'model_list.model', 'model_list.maker', 'general motors', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'car_makers.id', 'car_makers.fullname', 'cars_data.weight', 'model_list.model', 'model_list.maker', 'general motors', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'weight'}
{'weight'}
{'accelerate', 'horsepower'}
{'accelerate', 'horsepower'}
{'cars_data.cylinders', 'cars_data.accelerate', 'cars_data.id', 'car_names.model', 'car_names.makeid', 'volvo'}
{'cars_data.cylinders', 'cars_data.accelerate', 'cars_data.id', 'car_names.model', 'car_names.makeid', 'volvo'}
{'horsepower', 'accelerate'}
{'horsepower', 'accelerate'}
{'countries.countryname', 'car_makers.country', 'countries.countryid'}
{'car_makers.id', 'car_makers.country', 'countries.countryid'}
{'cylinders'}
{'cylinders'}
{'cars_data.cylinders', 'cars_data.horsepower', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'cars_data.cylinders', 'cars_data.horsepower', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'car_names.make', 'cars_data.horsepower', 'horsepower', 'cars_data.id', 'car_names.makeid'}
{'cars_data.horsepower', 'horsepower', 'cars_data.id', 'car_names.model', 'car_names.makeid'}
{'mpg', 'cylinders'}
{'mpg', 'cylinders'}
{'cars_data.weight', 'fullname', 'model_list.model', 'model_list.maker', 'cars_data.id', 'model_list.modelid', 'car_names.makeid', 'id'}
{'car_makers.id', 'car_makers.fullname', 'ford motor company', 'cars_data.weight', 'model_list.model', 'model_list.maker', 'cars_data.id', 'model_list.modelid', 'car_names.makeid'}
{'countryid', 'country', 'countryname'}
{'countryid', 'country', 'countryname'}
{'car_makers.id', 'car_names.make', 'model_list.model', 'model_list.maker', 'car_makers.maker', 'car_names.model'}
{'car_makers.id', 'car_names.make', 'model_list.model', 'model_list.maker', 'car_makers.maker', 'car_names.model'}
{'car_makers.id', 'fiat', 'countries.countryid', 'model_list.model', 'model_list.maker', 'countries.countryname', 'car_makers.country'}
{'car_makers.id', 'fiat', 'countries.countryid', 'model_list.model', 'model_list.maker', 'countries.countryname', 'car_makers.country'}
{'airline', 'country', 'jetblue airways'}
{'airline', 'country', 'jetblue airways'}
{'airline', 'jetblue airways', 'abbreviation'}
{'airline', 'jetblue airways', 'abbreviation'}
{'airline', 'country', 'abbreviation', 'usa'}
{'airline', 'country', 'abbreviation'}
{'anthony', 'city', 'airportname', 'airportcode'}
{'anthony', 'city', 'airportname', 'airportcode'}
set()
set()
set()
set()
set()
set()
{'airline', 'abbreviation'}
{'airline', 'abbreviation'}
set()
{'country'}
{'alton', 'airportname', 'country', 'city'}
{'alton', 'airportname', 'country', 'city'}
{'airportname', 'airportcode'}
{'airportname', 'airportcode'}
{'aberdeen', 'city', 'airportname'}
{'city', 'airportname'}
{'sourceairport'}
{'sourceairport'}
{'destairport'}
{'destairport'}
{'airports.airportcode', 'flights.sourceairport', 'airports.city', 'flights.airline'}
{'airports.airportcode', 'flights.sourceairport', 'airports.city'}
{'airports.airportcode', 'airports.city', 'flights.destairport'}
{'airports.airportcode', 'airports.city', 'flights.destairport'}
{'airports.airportcode', 'flights.sourceairport', 'airports.city', 'flights.destairport'}
{'airports.airportcode', 'flights.sourceairport', 'airports.city', 'flights.destairport'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'jetblue airways', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.destairport', 'flights.airline'}
{'asy', 'flights.destairport', 'flights.airline', 'airlines.airline', 'airlines.uid', 'united airlines'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'flights.sourceairport', 'flights.airline', 'airlines.airline', 'airports.airportcode', 'airports.city', 'flights.flightno', 'airlines.abbreviation'}
{'flights.airline', 'flights.destairport', 'airlines.airline', 'aberdeen', 'united airlines', 'airports.airportcode', 'airports.city'}
{'airports.city', 'airports.airportcode', 'flights.destairport'}
{'airports.city', 'airports.airportcode', 'flights.destairport'}
{'airports.city', 'flights.sourceairport', 'airports.airportcode'}
{'airports.city', 'flights.sourceairport', 'airports.airportcode'}
{'airports.airportcode', 'flights.sourceairport', 'flights.destairport'}
{'airports.airportcode', 'flights.sourceairport', 'flights.destairport'}
{'destairport'}
{'destairport'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.country', 'flights.airline', 'airlines.abbreviation', 'airlines.airline'}
{'airlines.country', 'flights.airline', 'airlines.abbreviation', 'airlines.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'flights.sourceairport', 'flights.airline', 'airlines.airline', 'airlines.uid', 'ahd'}
{'airlines.airline', 'airlines.uid', 'flights.destairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.destairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.sourceairport', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airlines.airline', 'airlines.uid', 'flights.airline'}
{'airline', 'flightno', 'united airlines'}
{'airline', 'flightno', 'united airlines'}
{'apg', 'sourceairport', 'flightno'}
{'sourceairport', 'flightno'}
{'apg', 'destairport', 'flightno'}
{'destairport', 'flightno'}
{'flights.sourceairport', 'airports.city', 'airports.airportcode', 'flights.flightno', 'aberdeen '}
{'sourceairport', 'flightno', 'city', 'aberdeen', 'airportcode'}
{'flights.destairport', 'aberdeen', 'airports.city', 'airports.airportcode', 'flights.flightno'}
{'flightno', 'city', 'aberdeen', 'airportcode', 'destairport'}
{'airports.airportcode', 'airports.city', 'flights.destairport'}
{'airports.airportcode', 'airports.city', 'flights.destairport'}
{'sourceairport', 'destairport', 'airportname', 'airportcode'}
{'sourceairport', 'destairport', 'airportname', 'airportcode'}
set()
set()
{'age', 'name'}
{'age', 'name'}
{'city'}
{'city'}
{'age', 'city'}
{'age', 'city'}
set()
set()
{'number_products', 'district', 'manager_name'}
{'number_products', 'district', 'manager_name'}
{'number_products'}
{'number_products'}
{'district', 'name', 'location', 'number_products'}
{'district', 'name', 'location', 'number_products'}
{'name', 'number_products'}
{'name', 'number_products'}
{'employee.employee_id', 'evaluation.employee_id', 'employee.name'}
{'employee.employee_id', 'evaluation.employee_id', 'employee.name'}
{'bonus', 'employee.name', 'evaluation.employee_id', 'employee.employee_id', 'evaluation.bonus'}
{'employee.employee_id', 'evaluation.bonus', 'evaluation.employee_id', 'employee.name'}
{'name', 'employee_id'}
{'name', 'employee_id'}
{'shop.shop_id', 'shop.name', 'hiring.shop_id'}
{'shop.shop_id', 'shop.name', 'hiring.shop_id'}
{'name', 'shop_id'}
{'name', 'shop_id'}
{'shop.shop_id', 'shop.name', 'hiring.shop_id'}
{'shop.shop_id', 'shop.name', 'hiring.shop_id'}
{'bonus'}
{'bonus'}
{'*'}
{'*'}
{'number_products', 'district'}
{'number_products', 'district'}
set()
set()
set()
set()
{'document_name', 'document_description', 'document_id'}
{'document_name', 'document_description', 'document_id'}
{'document_description', 'document_name', 'template_id'}
{'document_description', 'document_name', 'template_id'}
{'document_name', 'document_id', 'template_id', 'document_description', 'robbin cv'}
{'document_name', 'document_id', 'template_id', 'document_description', 'robbin cv'}
{'template_id'}
{'template_id'}
{'ppt', 'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'ppt', 'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'template_id'}
{'template_id'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'template_id'}
{'template_id'}
{'template_id'}
{'template_id'}
set()
set()
{'template_type_code', 'template_id', 'version_number'}
{'template_type_code', 'template_id', 'version_number'}
{'template_type_code'}
{'template_type_code'}
{'pp', 'template_type_code', 'ppt', 'template_id'}
{'pp', 'template_type_code', 'ppt', 'template_id'}
{'template_type_code', 'cv'}
{'template_type_code', 'cv'}
{'template_type_code', 'version_number'}
{'template_type_code', 'version_number'}
{'template_type_code'}
{'template_type_code'}
{'template_type_code'}
{'template_type_code'}
{'template_type_code'}
{'template_type_code'}
{'template_type_code', 'version_number'}
{'template_type_code', 'version_number'}
{'documents.template_id', 'documents.document_name', 'templates.template_id', 'templates.template_type_code', 'data base'}
{'documents.template_id', 'documents.document_name', 'templates.template_id', 'templates.template_type_code', 'data base'}
{'documents.template_id', 'documents.document_name', 'bk', 'templates.template_id', 'templates.template_type_code'}
{'document_name', 'documents.template_id', 'bk', 'templates.template_id', 'templates.template_type_code'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'templates.template_id', 'templates.template_type_code', 'documents.template_id'}
{'template_type_code'}
{'template_type_code', 'template_id'}
{'template_type_code', 'template_type_description'}
{'template_type_code', 'template_type_description'}
{'ad', 'template_type_code', 'template_type_description'}
{'ad', 'template_type_code', 'template_type_description'}
{'book', 'template_type_code', 'template_type_description'}
{'book', 'template_type_code', 'template_type_description'}
{'ref_template_types.template_type_code', 'ref_template_types.template_type_description', 'documents.template_id', 'templates.template_id', 'templates.template_type_code'}
{'ref_template_types.template_type_code', 'ref_template_types.template_type_description', 'documents.template_id', 'templates.template_id', 'templates.template_type_code'}
{'ref_template_types.template_type_code', 'template_id', 'template_type_description', 'templates.template_type_code', 'presentation'}
{'ref_template_types.template_type_code', 'template_id', 'template_type_description', 'templates.template_type_code', 'presentation'}
set()
set()
{'paragraphs.document_id', 'documents.document_name', 'paragraphs.paragraph_id', 'summer show', 'documents.document_id'}
{'documents.document_name', 'paragraphs.document_id', 'documents.document_id', 'summer show'}
{'paragraph_text', 'korea', 'other_details'}
{'paragraph_text', 'korea', 'other_details'}
{'paragraphs.document_id', 'documents.document_name', 'paragraphs.paragraph_id', 'welcome to ny', 'documents.document_id', 'paragraphs.paragraph_text'}
{'paragraphs.document_id', 'documents.document_name', 'paragraphs.paragraph_id', 'welcome to ny', 'documents.document_id', 'paragraphs.paragraph_text'}
{'paragraphs.document_id', 'customer reviews', 'documents.document_name', 'documents.document_id', 'paragraphs.paragraph_text'}
{'paragraphs.document_id', 'customer reviews', 'documents.document_name', 'documents.document_id', 'paragraphs.paragraph_text'}
{'document_id'}
{'document_id'}
{'documents.document_name', 'documents.document_id', 'paragraphs.document_id'}
{'documents.document_name', 'documents.document_id', 'paragraphs.document_id'}
{'document_id'}
{'document_id'}

In [5]:
import sqlite3


def execute(db_path: str, sql: str):

    conn = sqlite3.connect(db_path)

    # 创建一个游标对象
    cursor = conn.cursor()
    try:
        # 执行一个SQL语句
        cursor.execute(sql)

        # 获取查询结果
        rows = cursor.fetchall()

        return ""
    except sqlite3.Error as e:
        return str(e)

    finally:
        # 关闭游标和数据库连接
        if cursor:
            cursor.close()
        if conn:
            conn.close()


with open("./0315_step_2_final.json", "r") as input_file:
    pred_dataset = json.load(input_file)
with open(DEV_JSON_PATH, "r") as input_file:
    dev = json.load(input_file)
for i in range(len(pred_dataset)):
    db_id = dev[i]["db_id"]
    db_path = DATABASE_PATH_PATTERN.format(db_id=db_id)
    case = pred_dataset[i]
    position = case.find("[SQL Query]\nSELECT")
    sql = case[position + 12 :].strip()
    error = execute(db_path, sql)
    print(sql)
    if error != "":
        print(error)
    # break

SELECT count(*) FROM singer;
SELECT count(*) FROM singer;
SELECT name, country, age FROM singer ORDER BY age DESC;
SELECT name, country, age FROM singer ORDER BY age DESC;
SELECT avg(age), min(age), max(age) FROM singer WHERE country = 'France';
SELECT avg(age), min(age), max(age) FROM singer WHERE country = 'France';
SELECT name, song_release_year FROM singer ORDER BY age LIMIT 1;
SELECT name, song_release_year FROM singer WHERE age = (SELECT min(age) FROM singer);
SELECT DISTINCT country FROM singer WHERE age > 20;
SELECT DISTINCT country FROM singer WHERE age > 20;
SELECT country, count(*) FROM singer GROUP BY country;
SELECT country, count(*) FROM singer GROUP BY country;
SELECT song_name FROM singer WHERE age > (SELECT avg(age) FROM singer);
SELECT song_name FROM singer WHERE age > (SELECT avg(age) FROM singer);
SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000;
SELECT LOCATION, name FROM stadium WHERE capacity BETWEEN 5000 AND 10000;
SELECT max(capacity), avg(capacity) FROM stadium;
SELECT avg(capacity), max(capacity) FROM stadium;
SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1;
SELECT name, capacity FROM stadium ORDER BY average DESC LIMIT 1;
SELECT count(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015;
SELECT count(*) FROM concert WHERE YEAR = 2014 OR YEAR = 2015;
SELECT t2.name, count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id GROUP BY t1.stadium_id;
SELECT t2.stadium_id, count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id GROUP BY t2.stadium_id;
SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year >= 2014 GROUP BY t1.stadium_id ORDER BY count(*) DESC LIMIT 1;
SELECT t2.name, t2.capacity FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t1.year > 2013 GROUP BY t1.stadium_id ORDER BY count(*) DESC LIMIT 1;
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1;
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1;
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert);
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert);
SELECT country FROM singer WHERE age > 40 INTERSECT SELECT country FROM singer WHERE age < 30;
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE YEAR = 2014);
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert WHERE YEAR = 2014);
SELECT t2.concert_name, t2.theme, count(*) FROM singer_in_concert AS t1 JOIN concert AS t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_id;
SELECT t2.concert_name, t2.theme, count(*) FROM singer_in_concert AS t1 JOIN concert AS t2 ON t1.concert_id = t2.concert_id GROUP BY t2.concert_id;
SELECT t2.name, count(*) FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id GROUP BY t2.name;
SELECT t2.name, count(*) FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id GROUP BY t2.name;
SELECT t2.name FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id JOIN concert AS t3 ON t1.concert_id = t3.concert_id WHERE t3.year = 2014;
SELECT t2.name FROM singer_in_concert AS t1 JOIN singer AS t2 ON t1.singer_id = t2.singer_id JOIN concert AS t3 ON t1.concert_id = t3.concert_id WHERE t3.year = 2014;
SELECT name, country FROM singer WHERE song_name LIKE '%Hey%';
SELECT name, country FROM singer WHERE song_name LIKE '%Hey%';
SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE YEAR = 2014 INTERSECT SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE YEAR = 2015;
SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE YEAR = 2014 INTERSECT SELECT t2.name, t2.location FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE YEAR = 2015;
SELECT count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t2.capacity = (SELECT max(capacity) FROM stadium);
SELECT count(*) FROM concert AS t1 JOIN stadium AS t2 ON t1.stadium_id = t2.stadium_id WHERE t2.capacity = (SELECT max(capacity) FROM stadium);
SELECT count(*) FROM pets WHERE weight > 10;
SELECT count(*) FROM pets WHERE weight > 10;
SELECT weight FROM pets WHERE pettype = 'dog' AND pet_age = (SELECT MIN (pet_age) FROM pets WHERE pettype = 'dog');
SELECT weight FROM pets WHERE pettype = 'dog' ORDER BY pet_age ASC LIMIT 1;
SELECT max(weight), pettype FROM pets GROUP BY pettype;
SELECT max(weight), pettype FROM pets GROUP BY pettype;
SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.age > 20;
SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid WHERE t1.age > 20;
SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t1.sex = 'F' AND t3.pettype = 'dog';
SELECT count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t1.sex = 'F' AND t3.pettype = 'dog';
SELECT count(DISTINCT pettype) FROM pets;
SELECT count(DISTINCT pettype) FROM pets;
SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = "cat" OR t3.pettype = "dog";
SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = "cat" OR t3.pettype = "dog";
SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'cat' INTERSECT SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t3.petid = t2.petid WHERE t3.pettype = 'dog';
SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'cat' INTERSECT SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'dog';
SELECT major, age FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet JOIN pets ON has_pet.petid = pets.petid WHERE pettype = 'cat');
SELECT major, age FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet JOIN pets ON has_pet.petid = pets.petid WHERE pettype = 'cat');
SELECT stuid FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet AS t1 JOIN pets AS t2 ON t1.petid = t2.petid WHERE t2.pettype = 'cat');
SELECT stuid FROM student WHERE stuid NOT IN (SELECT t1.stuid FROM has_pet AS t1 JOIN pets AS t2 ON t1.petid = t2.petid WHERE t2.pettype = 'cat');
SELECT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'dog' EXCEPT SELECT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'cat';
SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'dog' EXCEPT SELECT t1.fname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pettype = 'cat';
SELECT pettype, weight FROM pets ORDER BY pet_age ASC LIMIT 1;
SELECT pettype, weight FROM pets ORDER BY pet_age ASC LIMIT 1;
SELECT petid, weight FROM pets WHERE pet_age > 1;
SELECT petid, weight FROM pets WHERE pet_age > 1;
SELECT pettype, avg(pet_age), max(pet_age) FROM pets GROUP BY pettype;
SELECT pettype, avg(pet_age), max(pet_age) FROM pets GROUP BY pettype;
SELECT pettype, avg(weight) FROM pets GROUP BY pettype;
SELECT pettype, avg(weight) FROM pets GROUP BY pettype;
SELECT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid;
SELECT DISTINCT t1.fname, t1.age FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid;
SELECT petid FROM student JOIN has_pet ON student.stuid = has_pet.stuid WHERE lname = 'Smith';
SELECT petid FROM student JOIN has_pet ON student.stuid = has_pet.stuid WHERE lname = "Smith";
SELECT count(*), t1.stuid FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid;
SELECT t1.stuid, count(*) FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid;
SELECT t1.fname, t1.sex FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING count(*) > 1;
SELECT t1.fname, t1.sex FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid GROUP BY t1.stuid HAVING count(*) > 1;
SELECT t1.lname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pet_age = 3 AND t3.pettype = "cat";
SELECT t1.lname FROM student AS t1 JOIN has_pet AS t2 ON t1.stuid = t2.stuid JOIN pets AS t3 ON t2.petid = t3.petid WHERE t3.pet_age = 3 AND t3.pettype = "cat";
SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet);
SELECT avg(age) FROM student WHERE stuid NOT IN (SELECT stuid FROM has_pet);
SELECT count(*) FROM continents;
SELECT count(*) FROM continents;
SELECT t1.continent, t2.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent GROUP BY t1.continent;
SELECT t1.continent, t1.countryname, t2.contid, count(*) FROM continents AS t2 JOIN countries AS t1 ON t2.contid = t1.continent GROUP BY t2.contid;
SELECT count(*) FROM countries;
SELECT count(*) FROM countries;
SELECT t1.fullname, t1.id, count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id;
SELECT t1.fullname, t1.id, count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.horsepower LIMIT 1;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.horsepower ASC LIMIT 1;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.weight < (SELECT avg(weight) FROM cars_data);
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE weight < (SELECT avg(weight) FROM cars_data);
SELECT DISTINCT t1.fullname FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker JOIN car_names AS t3 ON t2.model = t3.model JOIN cars_data AS t4 ON t3.makeid = t4.id WHERE t4.year = 1970;
SELECT DISTINCT t1.fullname FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker JOIN car_names AS t3 ON t2.model = t3.model JOIN cars_data AS t4 ON t3.makeid = t4.id WHERE t4.year = 1970;
SELECT t2.model, t1.year FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid ORDER BY t1.year ASC LIMIT 1;
SELECT t2.make FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t1.year = (SELECT min(year) FROM cars_data);
SELECT DISTINCT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t2.makeid = t3.id WHERE t3.year > 1980;
SELECT DISTINCT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t3.id = t2.makeid WHERE t3.year > 1980;
SELECT t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent JOIN car_makers AS t3 ON t2.countryid = t3.country GROUP BY t1.continent;
SELECT t1.continent, count(*) FROM continents AS t1 JOIN countries AS t2 ON t1.contid = t2.continent JOIN car_makers AS t3 ON t2.countryid = t3.country GROUP BY t1.continent;
SELECT t2.countryname FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid GROUP BY t2.countryname ORDER BY count(*) DESC LIMIT 1;
SELECT t2.countryname FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid GROUP BY t2.countryname ORDER BY count(*) DESC LIMIT 1;
SELECT count(*), t2.fullname FROM model_list AS t1 JOIN car_makers AS t2 ON t1.maker = t2.id GROUP BY t2.fullname;
SELECT count(*), t2.id, t2.fullname FROM model_list AS t1 JOIN car_makers AS t2 ON t1.maker = t2.id GROUP BY t2.id;
SELECT accelerate FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t2.model = "amc hornet sportabout (sw)";
SELECT accelerate FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t2.model = "amc hornet sportabout (sw)";
SELECT count(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = "france";
SELECT count(*) FROM car_makers AS t1 JOIN countries AS t2 ON t1.country = t2.countryid WHERE t2.countryname = 'france';
SELECT count(*) FROM model_list AS t1 JOIN car_makers AS t2 ON t1.maker = t2.id JOIN countries AS t3 ON t2.country = t3.countryid WHERE t3.countryname = 'usa';
SELECT count(*) FROM model_list AS t1 JOIN car_makers AS t2 ON t1.maker = t2.id JOIN countries AS t3 ON t2.country = t3.countryid WHERE t3.countryname = "usa";
SELECT avg(mpg) FROM cars_data WHERE cylinders = 4;
SELECT avg(mpg) FROM cars_data WHERE cylinders = 4;
SELECT min(weight) FROM cars_data WHERE cylinders = 8 AND YEAR = 1974;
SELECT min(weight) FROM cars_data WHERE cylinders = 8 AND YEAR = 1974;
SELECT maker, model FROM model_list;
SELECT maker, model FROM model_list;
SELECT t1.countryname, t1.countryid FROM countries AS t1 JOIN car_makers AS t2 ON t1.countryid = t2.country;
SELECT t1.countryname, t1.countryid FROM countries AS t1 JOIN car_makers AS t2 ON t1.countryid = t2.country;
SELECT count(*) FROM cars_data WHERE horsepower > 150;
SELECT count(*) FROM cars_data WHERE horsepower > 150;
SELECT avg(weight), YEAR FROM cars_data GROUP BY YEAR;
SELECT avg(weight), year FROM cars_data GROUP BY YEAR;
SELECT t1.countryname FROM countries AS t1 JOIN continents AS t2 ON t1.continent = t2.contid JOIN car_makers AS t3 ON t3.country = t1.countryid WHERE t2.continent = 'europe' GROUP BY t1.countryname HAVING count(*) >= 3;
SELECT t1.countryname FROM countries AS t1 JOIN continents AS t2 ON t1.continent = t2.contid JOIN car_makers AS t3 ON t3.country = t1.countryid WHERE t2.continent = 'europe' GROUP BY t1.countryname HAVING count(*) >= 3;
SELECT max(horsepower), t1.make FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.cylinders = 3;
SELECT max(horsepower), t1.make FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.cylinders = 3 GROUP BY t1.make;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.mpg DESC LIMIT 1;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id ORDER BY t2.mpg DESC LIMIT 1;
SELECT avg(horsepower) FROM cars_data WHERE YEAR < 1980;
SELECT avg(horsepower) FROM cars_data WHERE YEAR < 1980;
SELECT avg(t2.edispl) FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t1.model = "volvo";
SELECT avg(t2.edispl) FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t1.model = "volvo";
SELECT max(accelerate), cylinders FROM cars_data GROUP BY cylinders;
SELECT max(accelerate) FROM cars_data GROUP BY cylinders;
SELECT model FROM car_names GROUP BY model ORDER BY count(*) DESC LIMIT 1;
SELECT model FROM car_names GROUP BY model ORDER BY count(*) DESC LIMIT 1;
SELECT count(*) FROM cars_data WHERE cylinders > 4;
SELECT count(*) FROM cars_data WHERE cylinders > 4;
SELECT count(*) FROM cars_data WHERE YEAR = 1980;
SELECT count(*) FROM cars_data WHERE YEAR = 1980;
SELECT count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker WHERE t1.fullname = "American Motor Company";
SELECT count(*) FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker WHERE t1.fullname = "American Motor Company";
SELECT t1.fullname, t1.id FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id HAVING count(*) > 3;
SELECT t1.fullname, t1.id FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id HAVING count(*) > 3;
SELECT DISTINCT t1.model FROM car_names AS t1 JOIN model_list AS t2 ON t1.model = t2.model JOIN car_makers AS t3 ON t2.maker = t3.id JOIN cars_data AS t4 ON t4.id = t1.makeid WHERE t3.fullname = "General Motors" OR t4.weight > 3500;
SELECT DISTINCT t1.model FROM car_names AS t1 JOIN model_list AS t2 ON t1.model = t2.model JOIN car_makers AS t3 ON t2.maker = t3.id JOIN cars_data AS t4 ON t4.id = t1.makeid WHERE t3.fullname = "General Motors" OR t4.weight > 3500;
SELECT YEAR FROM cars_data WHERE weight BETWEEN 3000 AND 4000;
SELECT DISTINCT YEAR FROM cars_data WHERE weight < 4000 INTERSECT SELECT DISTINCT YEAR FROM cars_data WHERE weight > 3000;
SELECT horsepower FROM cars_data ORDER BY accelerate DESC LIMIT 1;
SELECT horsepower FROM cars_data ORDER BY accelerate DESC LIMIT 1;
SELECT t1.cylinders FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t2.model = "volvo" ORDER BY t1.accelerate ASC LIMIT 1;
SELECT t1.cylinders FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t2.model = 'volvo' ORDER BY t1.accelerate ASC LIMIT 1;
SELECT count(*) FROM cars_data WHERE accelerate > (SELECT max(horsepower) FROM cars_data);
SELECT count(*) FROM cars_data WHERE accelerate > (SELECT min(accelerate) FROM cars_data WHERE horsepower = (SELECT max(horsepower) FROM cars_data));
SELECT count(*) FROM countries WHERE countryid IN (SELECT country FROM car_makers GROUP BY country HAVING count(*) > 2);
SELECT COUNT (DISTINCT t1.countryname) FROM countries AS t1 JOIN car_makers AS t2 ON t1.countryid = t2.country GROUP BY t1.countryname HAVING count(*) > 2;
SELECT count(*) FROM cars_data WHERE cylinders > 6;
SELECT count(*) FROM cars_data WHERE cylinders > 6;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.cylinders = 4 ORDER BY t2.horsepower DESC LIMIT 1;
SELECT t1.model FROM car_names AS t1 JOIN cars_data AS t2 ON t1.makeid = t2.id WHERE t2.cylinders = 4 ORDER BY t2.horsepower DESC LIMIT 1;
SELECT t2.makeid, t2.make FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE horsepower > (SELECT min(horsepower) FROM cars_data) INTERSECT SELECT t2.makeid, t2.make FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE cylinders <= 3;
SELECT t2.makeid, t2.model FROM cars_data AS t1 JOIN car_names AS t2 ON t1.id = t2.makeid WHERE t1.horsepower != (SELECT min(horsepower) FROM cars_data) AND t1.cylinders < 4;
SELECT max(mpg) FROM cars_data WHERE cylinders = 8 OR YEAR < 1980;
SELECT max(mpg) FROM cars_data WHERE cylinders = 8 OR YEAR < 1980;
SELECT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t2.makeid = t3.id JOIN car_makers AS t4 ON t4.id = t1.maker WHERE t3.weight < 3500 AND t4.fullname != 'Ford Motor Company';
SELECT DISTINCT t1.model FROM model_list AS t1 JOIN car_names AS t2 ON t1.model = t2.model JOIN cars_data AS t3 ON t3.id = t2.makeid JOIN car_makers AS t4 ON t4.id = t1.maker WHERE t3.weight < 3500 AND t4.fullname != 'Ford Motor Company';
SELECT countryname FROM countries WHERE countryid NOT IN (SELECT country FROM car_makers);
SELECT countryname FROM countries WHERE countryid NOT IN (SELECT country FROM car_makers);
SELECT t1.id, t1.maker FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker JOIN car_names AS t3 ON t2.model = t3.model GROUP BY t1.id HAVING count(DISTINCT t3.make) > 3 AND count(DISTINCT t2.model) >= 2;
SELECT t1.id, t1.maker FROM car_makers AS t1 JOIN model_list AS t2 ON t1.id = t2.maker GROUP BY t1.id, t1.maker HAVING count(*) >= 2 INTERSECT SELECT t3.maker, count(*) FROM car_names AS t3 GROUP BY t3.maker HAVING count(*) > 3;
no such column: t3.maker
SELECT t1.countryid, t1.countryname FROM countries AS t1 JOIN car_makers AS t2 ON t1.countryid = t2.country GROUP BY t1.countryid HAVING count(*) > 3 UNION SELECT t1.countryid, t1.countryname FROM countries AS t1 JOIN car_makers AS t2 ON t1.countryid = t2.country JOIN model_list AS t3 ON t2.id = t3.maker WHERE t3.model = "fiat";

In [3]:
import json
with open("./0325_step1_test.json", "r") as input_file:
    pred_dataset = json.load(input_file)
with open("cot_dataset/test/step_1.json", "r") as input_file:
    dev = json.load(input_file)


def get_tables(out: str):
    position = out.find("[Relevant Tables]\n")
    if  position!=-1:
        sql = out[position + 18 :].strip()  
    else:
        sql = out
    sql=sql.replace("[","").replace("]","").lower()
            # print(sql)
    return set(sql.split(","))


error_count = 0
uncontain = 0
tables = []
for i in range(len(pred_dataset)):

    
    gold_output = dev[i]["output"]
    pred_output = pred_dataset[i]
    gold_tables = get_tables(gold_output)
    pred_tables = get_tables(pred_output)
    tables.append(list(pred_tables))
    if gold_tables != pred_tables:
        error_count += 1

        # print(gold_tables)
        # print(pred_tables)
    if not (gold_tables.issubset(pred_tables)):
        uncontain+=1
        print(i)
        print(gold_tables)
        print(pred_tables)
        print("raw",pred_output)
        print("----")
print(1-(error_count)/len(pred_dataset))
print(1-uncontain/len(pred_dataset))
with open("0328_step_1_output.json","w") as output:
    json.dump(tables, output)

77
{'orders', 'products', 'order_items'}
{'orders', 'shipments', 'invoices'}
raw [Relevant Tables]
orders,shipments,invoices
----
181
{'vehicle', 'vehicle_driver', 'driver'}
{'vehicle_driver', 'vehicle'}
raw [Relevant Tables]
vehicle_driver,vehicle
----
182
{'vehicle', 'vehicle_driver', 'driver'}
{'vehicle_driver', 'vehicle'}
raw [Relevant Tables]
vehicle_driver,vehicle
----
374
{'customers_and_services'}
{'services', 'customers'}
raw [Relevant Tables]
customers,services
----
378
{'services', 'customers', 'customer_interactions', 'customers_and_services'}
{'services', 'customer_interactions', 'customers_and_services'}
raw [Relevant Tables]
services,customers_and_services,customer_interactions
----
380
{'services', 'customers', 'customer_interactions', 'customers_and_services'}
{'customer_interactions', 'customers', 'services'}
raw [Relevant Tables]
customer_interactions,customers,services
----
449
{'teachers', 'classes'}
{'classes'}
raw [Relevant Tables]
classes
----
450
{'teachers', 'classes'}
{'classes'}
raw [Relevant Tables]
classes
----
467
{'ref_event_types', 'student_events', 'students'}
{'ref_event_types', 'student_events'}
raw [Relevant Tables]
student_events,ref_event_types
----
468
{'ref_event_types', 'student_events', 'students'}
{'ref_event_types', 'student_events'}
raw [Relevant Tables]
student_events,ref_event_types
----
471
{'teachers', 'classes', 'achievements'}
{'classes', 'achievements', 'students'}
raw [Relevant Tables]
classes,achievements,students
----
481
{'teachers', 'classes', 'students'}
{'classes'}
raw [Relevant Tables]
classes
----
482
{'teachers', 'classes', 'students'}
{'classes'}
raw [Relevant Tables]
classes
----
499
{'transcripts', 'teachers', 'classes'}
{'transcripts', 'classes', 'ref_event_types', 'students'}
raw [Relevant Tables]
classes,students,transcripts,ref_event_types
----
500
{'transcripts', 'teachers', 'classes'}
{'transcripts', 'classes', 'ref_event_types', 'students'}
raw [Relevant Tables]
classes,students,transcripts,ref_event_types
----
571
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
author_book,book
----
572
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
author_book,book
----
573
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
book,author_book
----
574
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
book,author_book
----
577
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
book,author_book
----
578
{'author_book', 'book', 'author'}
{'author_book', 'book'}
raw [Relevant Tables]
book,author_book
----
602
{'review', 'book'}
{'book'}
raw [Relevant Tables]
book
----
638
{'customer', 'customer_order'}
{'customer_order'}
raw [Relevant Tables]
customer_order
----
656
{'member', 'club', 'club_leader'}
{'club', 'club_leader'}
raw [Relevant Tables]
club_leader,club
----
669
{'document_objects'}
{'documents_in_collections'}
raw [Relevant Tables]
documents_in_collections
----
697
{'document_subset_members', 'document_objects'}
{'documents_in_collections', 'document_objects', 'collections'}
raw [Relevant Tables]
document_objects,documents_in_collections,collections
----
698
{'document_subset_members', 'document_objects'}
{'document_objects'}
raw [Relevant Tables]
document_objects
----
704
{'document_subset_members'}
{'documents_in_collections', 'collection_subset_members', 'document_objects'}
raw [Relevant Tables]
documents_in_collections,collection_subset_members,document_objects
----
705
{'document_subset_members'}
{'documents_in_collections', 'document_objects', 'collections'}
raw [Relevant Tables]
documents_in_collections,collections,document_objects
----
708
{'document_subset_members', 'document_objects'}
{'documents_in_collections', 'document_objects', 'collections'}
raw [Relevant Tables]
document_objects,documents_in_collections,collections
----
721
{'documents_in_collections', 'collections'}
{'documents_in_collections'}
raw [Relevant Tables]
documents_in_collections
----
722
{'documents_in_collections', 'collections'}
{'documents_in_collections'}
raw [Relevant Tables]
documents_in_collections
----
835
{'direct_distance', 'student'}
{'city', 'student'}
raw [Relevant Tables]
city,student
----
837
{'direct_distance', 'student'}
{'city', 'student'}
raw [Relevant Tables]
student,city
----
1021
{'paper', 'author_list', 'author'}
{'paper', 'author_list'}
raw [Relevant Tables]
author_list,paper
----
1022
{'paper', 'author_list', 'author'}
{'paper', 'author_list'}
raw [Relevant Tables]
author_list,paper
----
1047
{'citation', 'author_list', 'author'}
{'paper', 'author_list', 'citation'}
raw [Relevant Tables]
author_list,paper,citation
----
1048
{'citation', 'author_list', 'author'}
{'paper', 'author_list', 'citation'}
raw [Relevant Tables]
paper,citation,author_list
----
1095
{'conference', 'staff', 'institution', 'conference_participation'}
{'staff', 'institution', 'conference_participation'}
raw [Relevant Tables]
institution,staff,conference_participation
----
1096
{'conference', 'staff', 'institution', 'conference_participation'}
{'staff', 'institution', 'conference_participation'}
raw [Relevant Tables]
institution,staff,conference_participation
----
1117
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1119
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1138
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1155
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1156
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1175
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1176
{'pilotskills'}
{'hangar'}
raw [Relevant Tables]
hangar
----
1269
{'artists', 'sculptures', 'paintings'}
{'artistes', 'sculptures', 'paintings'}
raw [Relevant Tables]
paintings,sculptures,artistes
----
1311
{'artists', 'sculptures', 'paintings'}
{'artists', 'paintings'}
raw [Relevant Tables]
artists,paintings
----
1333
{'race', 'driver'}
{'race'}
raw [Relevant Tables]
race
----
1354
{'race', 'driver'}
{'race'}
raw [Relevant Tables]
race
----
1355
{'race', 'driver'}
{'race'}
raw [Relevant Tables]
race
----
1382
{'languages', 'official_languages'}
{'countries', 'official_languages'}
raw [Relevant Tables]
official_languages,countries
----
1383
{'languages', 'official_languages'}
{'countries', 'official_languages'}
raw [Relevant Tables]
official_languages,countries
----
1410
{'ref_user_categories', 'users'}
{'ref_age_categories', 'users'}
raw [Relevant Tables]
users,ref_age_categories
----
1467
{'properties', 'user_searches'}
{'users', 'user_searches'}
raw [Relevant Tables]
users,user_searches
----
1468
{'properties', 'users', 'user_searches'}
{'user_searches', 'users', 'user_property_history'}
raw [Relevant Tables]
users,user_property_history,user_searches
----
1469
{'properties', 'users', 'user_searches'}
{'user_searches', 'users', 'user_property_history'}
raw [Relevant Tables]
users,user_property_history,user_searches
----
1659
{'institution', 'championship'}
{'institution'}
raw [Relevant Tables]
institution
----
1660
{'institution', 'championship'}
{'institution'}
raw [Relevant Tables]
institution
----
1746
{'warehouses', 'boxes'}
{'boxes'}
raw [Relevant Tables]
boxes
----
1755
{'warehouses', 'boxes'}
{'warehouses'}
raw [Relevant Tables]
warehouses
----
1790
{'overall_ranking', 'university'}
{'university'}
raw [Relevant Tables]
university
----
1813
{'movietheaters', 'movies'}
{'movietheaters'}
raw [Relevant Tables]
movietheaters
----
1814
{'movietheaters', 'movies'}
{'movietheaters'}
raw [Relevant Tables]
movietheaters
----
1815
{'movietheaters', 'movies'}
{'movietheaters'}
raw [Relevant Tables]
movietheaters
----
1816
{'movietheaters', 'movies'}
{'movies'}
raw [Relevant Tables]
movies
----
1855
{'client', 'package'}
{'package'}
raw [Relevant Tables]
package
----
1865
{'has_clearance', 'employee'}
{'employee'}
raw [Relevant Tables]
employee
----
1900
{'employee', 'planet', 'shipment'}
{'employee', 'shipment'}
raw [Relevant Tables]
shipment,employee
----
1910
{'planet', 'package', 'shipment'}
{'planet', 'package'}
raw [Relevant Tables]
package,planet
----
1911
{'planet', 'package', 'shipment'}
{'package', 'shipment'}
raw [Relevant Tables]
shipment,package
----
1914
{'client', 'planet', 'package', 'shipment'}
{'package', 'client', 'shipment'}
raw [Relevant Tables]
client,package,shipment
----
1916
{'client', 'planet', 'package', 'shipment'}
{'client', 'package', 'shipment'}
raw [Relevant Tables]
package,shipment,client
----
1923
{'planet', 'has_clearance', 'employee'}
{'has_clearance', 'planet'}
raw [Relevant Tables]
planet,has_clearance
----
1924
{'planet', 'has_clearance', 'employee'}
{'has_clearance', 'planet'}
raw [Relevant Tables]
planet,has_clearance
----
2027
{'authors', 'documents'}
{'documents'}
raw [Relevant Tables]
documents
----
2034
{'process_outcomes'}
{'documents_processes'}
raw [Relevant Tables]
documents_processes
----
2146
{'staff', 'meetings', 'clients', 'staff_in_meetings'}
{'staff', 'meetings', 'staff_in_meetings'}
raw [Relevant Tables]
meetings,staff_in_meetings,staff
----
0.8812296227293899
0.9632044713553796